import React from "react";

export default function ToDo() {
    return (<div>
        <ul>
            <h3>В том числе для универа:</h3>
            <li>Добавить Slider</li>
            <li>Добавить графики</li>
            <li>Добавить аутентификацию на identity server</li>
            <li>Добавить аутентификацию в интерфейсе</li>
            <li>Добавить авторизацию в API</li>
            <li>Добавить призку данных к пользовтелю в API</li>
            <li>Добавить регистрацию в Identity Server</li>
            <li>Добавить аутентификацию на UI</li>
            <li>Добавить добавить регистрацию во фронте</li>
            <li>Добавить выход из аккаунта в Identity Server</li>
            <li>Добавить выход из аккаунта в UI</li>
            <li>Добавить обработку ошибок на UI</li>
            <li>Добавить модальные окна</li>

            <h3>Для себя:</h3>
            <li>Сортировка</li>
            <li>Пагинация</li>
            <li>Добавить калькулятор вкладов</li>
            <li>Добавить кредитный калькулятор</li>
            <li>Добавить зарплатный калькулятор</li>
            <li>Добавить отпускной калькулятор</li>
            <li>Добавить временной калькулятор</li>
            <li>Добавить логи</li>
            <li>Покрасить кнопки "Удалить" и "Изменить"</li>
            <li>Поменять цифры в перечислениях на слова</li>
            <li>Добавить активы</li>
            <li>Добавить обработку ошибок на бэке</li>
            <li>Добавить ассинхронность на бэке</li>
            <li>Добавить AutoMapper</li>
            <li>Поменять id счетов на какое-нибудь описание</li>

            <h3>В идеале:</h3>
            <li>Финансовые цели</li>
            <li>Задание бюджета по категориям</li>
            <li>Учет инфляции</li>

            <h3>Сделано:</h3>
            <li><del>Заменить тестовые поля для даты на DatePicker</del></li>
            <li><del>Добавить SideBar</del></li>
        </ul>
    </div>)
}